# -*- coding: utf-8 -*-
"""
Created on Sat Mar 30 21:47:12 2019

@author: night
"""
#                        .::::.
#                      .::::::::.
#                     :::::::::::
#                  ..:::::::::::'
#               '::::::::::::'
#                 .::::::::::
#            '::::::::::::::..
#                 ..::::::::::::.
#               ``::::::::::::::::
#                ::::``:::::::::'        .:::.
#               ::::'   ':::::'       .::::::::.
#             .::::'      ::::     .:::::::'::::.
#            .:::'       :::::  .:::::::::' ':::::.
#           .::'        :::::.:::::::::'      ':::::.
#          .::'         ::::::::::::::'         ``::::.
#      ...:::           ::::::::::::'              ``::.
#     ```` ':.          ':::::::::'                  ::::..
#                        '.:::::'                    ':'````..
#                     美女保佑 永无BUG
import torch
import torch.nn as nn
import numpy as np
import matplotlib.pyplot as plt


class W_DC_C_GAN_D(nn.model):
    def __init__(self,ninp,nhid,noutp,nlayers):
        super(W_DC_C_GAN_D,self).__init__()
        
        